In [1]:
import pandas as pd
import numpy as np

In [2]:
sozluk1 = {"Isım": ["Ahmet","Mehmet","Zeynep","Enes"],
          "Spor": ["Koşu","Yüzme","Koşu","Futbol"],
          "Kalori": [100,200,250,500]
          }

In [3]:
dataFrame1 = pd.DataFrame(sozluk1, index = [0,1,2,3])
dataFrame1

     Isım    Spor  Kalori
0   Ahmet    Koşu     100
1  Mehmet   Yüzme     200
2  Zeynep    Koşu     250
3    Enes  Futbol     500

In [4]:
sozluk2 = {"Isım": ["Furkan","Muhammed","Merve","Yılmaz"],
          "Spor": ["Futbol","Basketbol","Voleybol","Judo"],
          "Kalori": [500,1000,300,550]
          }

In [5]:
dataFrame2 = pd.DataFrame(sozluk2, index = [4,5,6,7])
dataFrame2

       Isım       Spor  Kalori
4    Furkan     Futbol     500
5  Muhammed  Basketbol    1000
6     Merve   Voleybol     300
7    Yılmaz       Judo     550

In [6]:
sozluk3 = {"Isım": ["Ali","Veli","Deli","Tigin"],
          "Spor": ["Tenis","Yoga","Koşu","Gures"],
          "Kalori": [250,350,350,500]
          }

In [7]:
dataFrame3 = pd.DataFrame(sozluk3, index = [8,9,10,11])
dataFrame3

     Isım   Spor  Kalori
8     Ali  Tenis     250
9    Veli   Yoga     350
10   Deli   Koşu     350
11  Tigin  Gures     500

## concatenation

In [8]:
# eğer veride kolanlar aynı ise bunu kullanabiliriz bu komut aslında yan yanya koyma yapıyor

In [9]:
pd.concat([dataFrame1, dataFrame2, dataFrame3])
# bu axis 1 kolonlar birleştirme yapıyoruz ama axis 0 desydik o zaman farklı bir tablo verirdi bize

        Isım       Spor  Kalori
0      Ahmet       Koşu     100
1     Mehmet      Yüzme     200
2     Zeynep       Koşu     250
3       Enes     Futbol     500
4     Furkan     Futbol     500
5   Muhammed  Basketbol    1000
6      Merve   Voleybol     300
7     Yılmaz       Judo     550
8        Ali      Tenis     250
9       Veli       Yoga     350
10      Deli       Koşu     350
11     Tigin      Gures     500

## merge

In [10]:
mergeSozluk1 = {"Isım": ["Ahmet","Mehmet","Zeynep","Enes"],
               "Spor": ["Koşu","Yüzme","Koşu","Futbol"]
               }

In [11]:
mergeDataFrame1 = pd.DataFrame(mergeSozluk1)
mergeDataFrame1

     Isım    Spor
0   Ahmet    Koşu
1  Mehmet   Yüzme
2  Zeynep    Koşu
3    Enes  Futbol

In [12]:
mergeSozluk2 = {"Isım": ["Ahmet","Mehmet","Zeynep","Enes"],
               "Kalori": [100,200,250,500]
               }

In [13]:
mergeDataFrame2 = pd.DataFrame(mergeSozluk2)
mergeDataFrame2

     Isım  Kalori
0   Ahmet     100
1  Mehmet     200
2  Zeynep     250
3    Enes     500

In [14]:
# merge yaapbilmek için ortak noktalarını söylemek gerekiyor
pd.merge(mergeDataFrame1,mergeDataFrame2, on = "Isım")

     Isım    Spor  Kalori
0   Ahmet    Koşu     100
1  Mehmet   Yüzme     200
2  Zeynep    Koşu     250
3    Enes  Futbol     500

## pandas ileri işlemlerden devam

In [15]:
maasSozluk = {"Isım": ["Muhammed", "Enes", "Yılmaz", "Furkan"],
              "Departman": ["Yazılım", "Finans", "Arge", "Yazılım"],
              "Maas": [200,300,400,500]
             }

In [16]:
maasDataFrame = pd.DataFrame(maasSozluk)
maasDataFrame

       Isım Departman  Maas
0  Muhammed   Yazılım   200
1      Enes    Finans   300
2    Yılmaz      Arge   400
3    Furkan   Yazılım   500

In [17]:
# örneğin elimizde binlerce verinin olduğu bir set olsun ondan tekrar edenleri 
# değil de unique olanları getir demek istersek
maasDataFrame["Departman"].unique()

array(['Yazılım', 'Finans', 'Arge'], dtype=object)

In [18]:
# unique gelenlerin sayısı kaç tane öğrenmek istersek
maasDataFrame["Departman"].nunique()

3

In [19]:
maasDataFrame["Departman"].value_counts()

Yazılım    2
Finans     1
Arge       1
Name: Departman, dtype: int64

In [20]:
def bruttenNete(maas):
    return maas * 0.66

In [21]:
# örneğin metot u kullanmak istedik data frame imiz içinde
maasDataFrame["Maas"].apply(bruttenNete)

0    132.0
1    198.0
2    264.0
3    330.0
Name: Maas, dtype: float64

In [22]:
maasDataFrame.isnull()

    Isım  Departman   Maas
0  False      False  False
1  False      False  False
2  False      False  False
3  False      False  False

## pivot table oluşturma

In [23]:
yeniBirVeri = {"Karakter Sınıfı" : ["South Park", "South Park", "Simpson", "Simpson", "Simpson"],
              "Karakter Ismi" : ["Cartman", "Kenny", "Homer", "Bart", "Bart"],
              "Karakter Yas" : [9,10,50,20,10]
              }

In [24]:
karakterDF = pd.DataFrame(yeniBirVeri)
karakterDF

  Karakter Sınıfı Karakter Ismi  Karakter Yas
0      South Park       Cartman             9
1      South Park         Kenny            10
2         Simpson         Homer            50
3         Simpson          Bart            20
4         Simpson          Bart            10

In [25]:
karakterDF.pivot_table(values = "Karakter Yas", index = ["Karakter Sınıfı", "Karakter Ismi"], aggfunc= np.sum)
# burada aggfunc diye belirttiğimiz aynı olan verilerin ne yapılacağını karar veriyoruz biz burada topladık mesela

                               Karakter Yas
Karakter Sınıfı Karakter Ismi
Simpson         Bart                     30
                Homer                    50
South Park      Cartman                   9
                Kenny                    10